MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1765/mcu.h
// Register: PWM5OFCON
#define PWM5OFCON PWM5OFCON
extern volatile unsigned char           PWM5OFCON           __at(0xDA0);
#ifndef _LIB_BUILD
asm("PWM5OFCON equ 0DA0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned OFO                    :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM5OFMC               :1;
    };
} PWM5OFCONbits_t;
extern volatile PWM5OFCONbits_t PWM5OFCONbits __at(0xDA0);
// bitfield macros
#define _PWM5OFCON_OFO_POSN                                 0x4
#define _PWM5OFCON_OFO_POSITION                             0x4
#define _PWM5OFCON_OFO_SIZE                                 0x1
#define _PWM5OFCON_OFO_LENGTH                               0x1
#define _PWM5OFCON_OFO_MASK                                 0x10
#define _PWM5OFCON_PWM5OFMC_POSN                            0x4
#define _PWM5OFCON_PWM5OFMC_POSITION                        0x4
#define _PWM5OFCON_PWM5OFMC_SIZE                            0x1
#define _PWM5OFCON_PWM5OFMC_LENGTH                          0x1
#define _PWM5OFCON_PWM5OFMC_MASK                            0x10

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0xE0F);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 0E0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
extern volatile PPSLOCKbits_t PPSLOCKbits __at(0xE0F);
// bitfield macros
#define _PPSLOCK_PPSLOCKED_POSN                             0x0
#define _PPSLOCK_PPSLOCKED_POSITION                         0x0
#define _PPSLOCK_PPSLOCKED_SIZE                             0x1
#define _PPSLOCK_PPSLOCKED_LENGTH                           0x1
#define _PPSLOCK_PPSLOCKED_MASK                             0x1

// Register: INTPPS
#define INTPPS INTPPS
extern volatile unsigned char           INTPPS              __at(0xE10);
#ifndef _LIB_BUILD
asm("INTPPS equ 0E10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTPPS                 :5;
    };
} INTPPSbits_t;
extern volatile INTPPSbits_t INTPPSbits __at(0xE10);
// bitfield macros
#define _INTPPS_INTPPS_POSN                                 0x0
#define _INTPPS_INTPPS_POSITION                             0x0
#define _INTPPS_INTPPS_SIZE                                 0x5
#define _INTPPS_INTPPS_LENGTH                               0x5
#define _INTPPS_INTPPS_MASK                                 0x1F

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
extern volatile unsigned char           T0CKIPPS            __at(0xE11);
#ifndef _LIB_BUILD
asm("T0CKIPPS equ 0E11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T0CKIPPS               :5;
    };
} T0CKIPPSbits_t;
extern volatile T0CKIPPSbits_t T0CKIPPSbits __at(0xE11);
// bitfield macros
#define _T0CKIPPS_T0CKIPPS_POSN                             0x0
#define _T0CKIPPS_T0CKIPPS_POSITION                         0x0
#define _T0CKIPPS_T0CKIPPS_SIZE                             0x5
#define _T0CKIPPS_T0CKIPPS_LENGTH                           0x5
#define _T0CKIPPS_T0CKIPPS_MASK                             0x1F

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
extern volatile unsigned char           T1CKIPPS            __at(0xE12);
#ifndef _LIB_BUILD
asm("T1CKIPPS equ 0E12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1CKIPPS               :5;
    };
} T1CKIPPSbits_t;
extern volatile T1CKIPPSbits_t T1CKIPPSbits __at(0xE12);
// bitfield macros
#define _T1CKIPPS_T1CKIPPS_POSN                             0x0
#define _T1CKIPPS_T1CKIPPS_POSITION                         0x0
#define _T1CKIPPS_T1CKIPPS_SIZE                             0x5
#define _T1CKIPPS_T1CKIPPS_LENGTH                           0x5
#define _T1CKIPPS_T1CKIPPS_MASK                             0x1F

// Register: T1GPPS
#define T1GPPS T1GPPS
extern volatile unsigned char           T1GPPS              __at(0xE13);
#ifndef _LIB_BUILD
asm("T1GPPS equ 0E13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1GPPS                 :5;
    };
} T1GPPSbits_t;
extern volatile T1GPPSbits_t T1GPPSbits __at(0xE13);
// bitfield macros
#define _T1GPPS_T1GPPS_POSN                                 0x0
#define _T1GPPS_T1GPPS_POSITION                             0x0
#define _T1GPPS_T1GPPS_SIZE                                 0x5
#define _T1GPPS_T1GPPS_LENGTH                               0x5
#define _T1GPPS_T1GPPS_MASK                                 0x1F

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
extern volatile unsigned char           CCP1PPS             __at(0xE14);
#ifndef _LIB_BUILD
asm("CCP1PPS equ 0E14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1PPS                :5;
    };
} CCP1PPSbits_t;
extern volatile CCP1PPSbits_t CCP1PPSbits __at(0xE14);
// bitfield macros
#define _CCP1PPS_CCP1PPS_POSN                               0x0
#define _CCP1PPS_CCP1PPS_POSITION                           0x0
#define _CCP1PPS_CCP1PPS_SIZE                               0x5
#define _CCP1PPS_CCP1PPS_LENGTH                             0x5
#define _CCP1PPS_CCP1PPS_MASK                               0x1F

// Register: COG1INPPS
#define COG1INPPS COG1INPPS
extern volatile unsigned char           COG1INPPS           __at(0xE16);
#ifndef _LIB_BUILD
asm("COG1INPPS equ 0E16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned COG1INPPS              :5;
    };
} COG1INPPSbits_t;
extern volatile COG1INPPSbits_t COG1INPPSbits __at(0xE16);
// bitfield macros
#define _COG1INPPS_COG1INPPS_POSN                           0x0
#define _COG1INPPS_COG1INPPS_POSITION                       0x0
#define _COG1INPPS_COG1INPPS_SIZE                           0x5
#define _COG1INPPS_COG1INPPS_LENGTH                         0x5
#define _COG1INPPS_COG1INPPS_MASK                           0x1F

// Register: T2INPPS
#define T2INPPS T2INPPS
extern volatile unsigned char           T2INPPS             __at(0xE19);
#ifndef _LIB_BUILD
asm("T2INPPS equ 0E19h");
#endif
// aliases
extern volatile unsigned char           T2CKIPPS            __at(0xE19);
#ifndef _LIB_BUILD
asm("T2CKIPPS equ 0E19h");
#endif
extern volatile unsigned char           T2PPS               __at(0xE19);
#ifndef _LIB_BUILD
asm("T2PPS equ 0E19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T2INPPS                :5;
    };
} T2INPPSbits_t;
