MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1765/mcu.h
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x14A2);	// @ (0x294 * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x149F);	// @ (0x293 * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x149C);	// @ (0x293 * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x8A);	// @ (0x11 * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1498);	// @ (0x293 * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1499);	// @ (0x293 * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x149A);	// @ (0x293 * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x149B);	// @ (0x293 * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x149D);	// @ (0x293 * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// PIE1<CCPIE>
extern volatile __bit                   CCPIE               __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 CCPIE_bit           _BIT_ACCESS(PIE1,2)
// PIR1<CCPIF>
extern volatile __bit                   CCPIF               __at(0x8A);	// @ (0x11 * 8 + 2)
#define                                 CCPIF_bit           _BIT_ACCESS(PIR1,2)
// PMCON1<CFGS>
extern volatile __bit                   CFGS                __at(0xCAE);	// @ (0x195 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(PMCON1,6)
// MD1CARH<CH0>
extern volatile __bit                   CH0                 __at(0x1CF8);	// @ (0x39F * 8 + 0)
#define                                 CH0_bit             _BIT_ACCESS(MD1CARH,0)
// MD1CARH<CH1>
extern volatile __bit                   CH1                 __at(0x1CF9);	// @ (0x39F * 8 + 1)
#define                                 CH1_bit             _BIT_ACCESS(MD1CARH,1)
// MD1CARH<CH2>
extern volatile __bit                   CH2                 __at(0x1CFA);	// @ (0x39F * 8 + 2)
#define                                 CH2_bit             _BIT_ACCESS(MD1CARH,2)
// MD1CARH<CH3>
extern volatile __bit                   CH3                 __at(0x1CFB);	// @ (0x39F * 8 + 3)
#define                                 CH3_bit             _BIT_ACCESS(MD1CARH,3)
// MD1CON1<CHPOL>
extern volatile __bit                   CHPOL               __at(0x1CE5);	// @ (0x39C * 8 + 5)
#define                                 CHPOL_bit           _BIT_ACCESS(MD1CON1,5)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON0<CHS4>
extern volatile __bit                   CHS4                __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 CHS4_bit            _BIT_ACCESS(ADCON0,6)
// MD1CON1<CHSYNC>
extern volatile __bit                   CHSYNC              __at(0x1CE4);	// @ (0x39C * 8 + 4)
#define                                 CHSYNC_bit          _BIT_ACCESS(MD1CON1,4)
// SSP1STAT<CKE>
extern volatile __bit                   CKE                 __at(0x10A6);	// @ (0x214 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x10AC);	// @ (0x215 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// MD1CARL<CL0>
extern volatile __bit                   CL0                 __at(0x1CF0);	// @ (0x39E * 8 + 0)
#define                                 CL0_bit             _BIT_ACCESS(MD1CARL,0)
// MD1CARL<CL1>
extern volatile __bit                   CL1                 __at(0x1CF1);	// @ (0x39E * 8 + 1)
#define                                 CL1_bit             _BIT_ACCESS(MD1CARL,1)
// MD1CARL<CL2>
extern volatile __bit                   CL2                 __at(0x1CF2);	// @ (0x39E * 8 + 2)
#define                                 CL2_bit             _BIT_ACCESS(MD1CARL,2)
// MD1CARL<CL3>
extern volatile __bit                   CL3                 __at(0x1CF3);	// @ (0x39E * 8 + 3)
#define                                 CL3_bit             _BIT_ACCESS(MD1CARL,3)
// PIE3<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x98);	// @ (0x13 * 8 + 0)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR3,0)
// PIE3<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x99);	// @ (0x13 * 8 + 1)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR3,1)
// PIE3<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x49A);	// @ (0x93 * 8 + 2)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x9A);	// @ (0x13 * 8 + 2)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR3,2)
// MD1CON1<CLPOL>
extern volatile __bit                   CLPOL               __at(0x1CE1);	// @ (0x39C * 8 + 1)
#define                                 CLPOL_bit           _BIT_ACCESS(MD1CON1,1)
// MD1CON1<CLSYNC>
extern volatile __bit                   CLSYNC              __at(0x1CE0);	// @ (0x39C * 8 + 0)
#define                                 CLSYNC_bit          _BIT_ACCESS(MD1CON1,0)
// PIR3<COG1IF>
extern volatile __bit                   COG1IF              __at(0x9D);	// @ (0x13 * 8 + 5)
#define                                 COG1IF_bit          _BIT_ACCESS(PIR3,5)
// PIE3<COGIE>
extern volatile __bit                   COGIE               __at(0x49D);	// @ (0x93 * 8 + 5)
#define                                 COGIE_bit           _BIT_ACCESS(PIE3,5)
// RC1STA<CREN>
extern volatile __bit                   CREN                __at(0xCEC);	// @ (0x19D * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RC1STA,4)
// TX1STA<CSRC>
extern volatile __bit                   CSRC                __at(0xCF7);	// @ (0x19E * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TX1STA,7)
// CCP1CAP<CTS0>
extern volatile __bit                   CTS0                __at(0x14A0);	// @ (0x294 * 8 + 0)
#define                                 CTS0_bit            _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CTS1>
extern volatile __bit                   CTS1                __at(0x14A1);	// @ (0x294 * 8 + 1)
#define                                 CTS1_bit            _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CTS2>
extern volatile __bit                   CTS2                __at(0x14A2);	// @ (0x294 * 8 + 2)
#define                                 CTS2_bit            _BIT_ACCESS(CCP1CAP,2)
// STATUS_SHAD<C_SHAD>
extern volatile __bit                   C_SHAD              __at(0x7F20);	// @ (0xFE4 * 8 + 0)
#define                                 C_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,0)
// DAC1CON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x2C8F);	// @ (0x591 * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DAC1CON0,7)
// DAC1CON0<DAC1FM>
extern volatile __bit                   DAC1FM              __at(0x2C8E);	// @ (0x591 * 8 + 6)
#define                                 DAC1FM_bit          _BIT_ACCESS(DAC1CON0,6)
// DACLD<DAC1LD>
extern volatile __bit                   DAC1LD              __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 DAC1LD_bit          _BIT_ACCESS(DACLD,0)
// DAC1CON0<DAC1NSS0>
extern volatile __bit                   DAC1NSS0            __at(0x2C88);	// @ (0x591 * 8 + 0)
#define                                 DAC1NSS0_bit        _BIT_ACCESS(DAC1CON0,0)
// DAC1CON0<DAC1OE1>
extern volatile __bit                   DAC1OE1             __at(0x2C8D);	// @ (0x591 * 8 + 5)
#define                                 DAC1OE1_bit         _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x2C8A);	// @ (0x591 * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x2C8B);	// @ (0x591 * 8 + 3)
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DAC1CON0,3)
// DAC1REFL<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DAC1REFL,0)
// DAC1REFL<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x2C91);	// @ (0x592 * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1REFL,1)
// DAC1REFH<DAC1R10>
extern volatile __bit                   DAC1R10             __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 DAC1R10_bit         _BIT_ACCESS(DAC1REFH,2)
// DAC1REFH<DAC1R11>
extern volatile __bit                   DAC1R11             __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 DAC1R11_bit         _BIT_ACCESS(DAC1REFH,3)
// DAC1REFH<DAC1R12>
extern volatile __bit                   DAC1R12             __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 DAC1R12_bit         _BIT_ACCESS(DAC1REFH,4)
// DAC1REFH<DAC1R13>
extern volatile __bit                   DAC1R13             __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 DAC1R13_bit         _BIT_ACCESS(DAC1REFH,5)
// DAC1REFH<DAC1R14>
extern volatile __bit                   DAC1R14             __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 DAC1R14_bit         _BIT_ACCESS(DAC1REFH,6)
// DAC1REFH<DAC1R15>
extern volatile __bit                   DAC1R15             __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 DAC1R15_bit         _BIT_ACCESS(DAC1REFH,7)
// DAC1REFL<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x2C92);	// @ (0x592 * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1REFL,2)
// DAC1REFL<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x2C93);	// @ (0x592 * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1REFL,3)
// DAC1REFL<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1REFL,4)
// DAC1REFL<DAC1R5>
extern volatile __bit                   DAC1R5              __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 DAC1R5_bit          _BIT_ACCESS(DAC1REFL,5)
// DAC1REFL<DAC1R6>
extern volatile __bit                   DAC1R6              __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 DAC1R6_bit          _BIT_ACCESS(DAC1REFL,6)
// DAC1REFL<DAC1R7>
extern volatile __bit                   DAC1R7              __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 DAC1R7_bit          _BIT_ACCESS(DAC1REFL,7)
// DAC1REFH<DAC1R8>
extern volatile __bit                   DAC1R8              __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 DAC1R8_bit          _BIT_ACCESS(DAC1REFH,0)
// DAC1REFH<DAC1R9>
extern volatile __bit                   DAC1R9              __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 DAC1R9_bit          _BIT_ACCESS(DAC1REFH,1)
// DAC1REFL<DAC1REF0>
extern volatile __bit                   DAC1REF0            __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 DAC1REF0_bit        _BIT_ACCESS(DAC1REFL,0)
// DAC1REFL<DAC1REF1>
extern volatile __bit                   DAC1REF1            __at(0x2C91);	// @ (0x592 * 8 + 1)
#define                                 DAC1REF1_bit        _BIT_ACCESS(DAC1REFL,1)
// DAC1REFH<DAC1REF10>
extern volatile __bit                   DAC1REF10           __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 DAC1REF10_bit       _BIT_ACCESS(DAC1REFH,2)
// DAC1REFH<DAC1REF11>
extern volatile __bit                   DAC1REF11           __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 DAC1REF11_bit       _BIT_ACCESS(DAC1REFH,3)
// DAC1REFH<DAC1REF12>
extern volatile __bit                   DAC1REF12           __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 DAC1REF12_bit       _BIT_ACCESS(DAC1REFH,4)
// DAC1REFH<DAC1REF13>
extern volatile __bit                   DAC1REF13           __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 DAC1REF13_bit       _BIT_ACCESS(DAC1REFH,5)
// DAC1REFH<DAC1REF14>
extern volatile __bit                   DAC1REF14           __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 DAC1REF14_bit       _BIT_ACCESS(DAC1REFH,6)
// DAC1REFH<DAC1REF15>
extern volatile __bit                   DAC1REF15           __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 DAC1REF15_bit       _BIT_ACCESS(DAC1REFH,7)
// DAC1REFL<DAC1REF2>
extern volatile __bit                   DAC1REF2            __at(0x2C92);	// @ (0x592 * 8 + 2)
#define                                 DAC1REF2_bit        _BIT_ACCESS(DAC1REFL,2)
// DAC1REFL<DAC1REF3>
extern volatile __bit                   DAC1REF3            __at(0x2C93);	// @ (0x592 * 8 + 3)
#define                                 DAC1REF3_bit        _BIT_ACCESS(DAC1REFL,3)
// DAC1REFL<DAC1REF4>
extern volatile __bit                   DAC1REF4            __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 DAC1REF4_bit        _BIT_ACCESS(DAC1REFL,4)
// DAC1REFL<DAC1REF5>
extern volatile __bit                   DAC1REF5            __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 DAC1REF5_bit        _BIT_ACCESS(DAC1REFL,5)
// DAC1REFL<DAC1REF6>
extern volatile __bit                   DAC1REF6            __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 DAC1REF6_bit        _BIT_ACCESS(DAC1REFL,6)
// DAC1REFL<DAC1REF7>
extern volatile __bit                   DAC1REF7            __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 DAC1REF7_bit        _BIT_ACCESS(DAC1REFL,7)
// DAC1REFH<DAC1REF8>
extern volatile __bit                   DAC1REF8            __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 DAC1REF8_bit        _BIT_ACCESS(DAC1REFH,0)
// DAC1REFH<DAC1REF9>
extern volatile __bit                   DAC1REF9            __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 DAC1REF9_bit        _BIT_ACCESS(DAC1REFH,1)
// DAC3CON0<DAC3EN>
extern volatile __bit                   DAC3EN              __at(0x2CBF);	// @ (0x597 * 8 + 7)
#define                                 DAC3EN_bit          _BIT_ACCESS(DAC3CON0,7)
// DAC3CON0<DAC3NSS>
extern volatile __bit                   DAC3NSS             __at(0x2CB8);	// @ (0x597 * 8 + 0)
#define                                 DAC3NSS_bit         _BIT_ACCESS(DAC3CON0,0)
// DAC3CON0<DAC3OE1>
extern volatile __bit                   DAC3OE1             __at(0x2CBD);	// @ (0x597 * 8 + 5)
#define                                 DAC3OE1_bit         _BIT_ACCESS(DAC3CON0,5)
// DAC3CON0<DAC3PSS0>
extern volatile __bit                   DAC3PSS0            __at(0x2CBA);	// @ (0x597 * 8 + 2)
#define                                 DAC3PSS0_bit        _BIT_ACCESS(DAC3CON0,2)
// DAC3CON0<DAC3PSS1>
extern volatile __bit                   DAC3PSS1            __at(0x2CBB);	// @ (0x597 * 8 + 3)
#define                                 DAC3PSS1_bit        _BIT_ACCESS(DAC3CON0,3)
// DAC3REF<DAC3R0>
extern volatile __bit                   DAC3R0              __at(0x2CC0);	// @ (0x598 * 8 + 0)
#define                                 DAC3R0_bit          _BIT_ACCESS(DAC3REF,0)
// DAC3REF<DAC3R1>
extern volatile __bit                   DAC3R1              __at(0x2CC1);	// @ (0x598 * 8 + 1)
#define                                 DAC3R1_bit          _BIT_ACCESS(DAC3REF,1)
// DAC3REF<DAC3R2>
extern volatile __bit                   DAC3R2              __at(0x2CC2);	// @ (0x598 * 8 + 2)
#define                                 DAC3R2_bit          _BIT_ACCESS(DAC3REF,2)
// DAC3REF<DAC3R3>
extern volatile __bit                   DAC3R3              __at(0x2CC3);	// @ (0x598 * 8 + 3)
#define                                 DAC3R3_bit          _BIT_ACCESS(DAC3REF,3)
// DAC3REF<DAC3R4>
extern volatile __bit                   DAC3R4              __at(0x2CC4);	// @ (0x598 * 8 + 4)
#define                                 DAC3R4_bit          _BIT_ACCESS(DAC3REF,4)
// DAC3REF<DAC3REF0>
extern volatile __bit                   DAC3REF0            __at(0x2CC0);	// @ (0x598 * 8 + 0)
#define                                 DAC3REF0_bit        _BIT_ACCESS(DAC3REF,0)
// DAC3REF<DAC3REF1>
extern volatile __bit                   DAC3REF1            __at(0x2CC1);	// @ (0x598 * 8 + 1)
#define                                 DAC3REF1_bit        _BIT_ACCESS(DAC3REF,1)
// DAC3REF<DAC3REF2>
extern volatile __bit                   DAC3REF2            __at(0x2CC2);	// @ (0x598 * 8 + 2)
#define                                 DAC3REF2_bit        _BIT_ACCESS(DAC3REF,2)
// DAC3REF<DAC3REF3>
extern volatile __bit                   DAC3REF3            __at(0x2CC3);	// @ (0x598 * 8 + 3)
#define                                 DAC3REF3_bit        _BIT_ACCESS(DAC3REF,3)
// DAC3REF<DAC3REF4>
extern volatile __bit                   DAC3REF4            __at(0x2CC4);	// @ (0x598 * 8 + 4)
#define                                 DAC3REF4_bit        _BIT_ACCESS(DAC3REF,4)
// DAC3REF<DAC3REF5>
extern volatile __bit                   DAC3REF5            __at(0x2CC5);	// @ (0x598 * 8 + 5)
#define                                 DAC3REF5_bit        _BIT_ACCESS(DAC3REF,5)
// DAC1CON0<DACFM>
extern volatile __bit                   DACFM               __at(0x2C8E);	// @ (0x591 * 8 + 6)
#define                                 DACFM_bit           _BIT_ACCESS(DAC1CON0,6)
// DAC3CON0<DACNSS>
extern volatile __bit                   DACNSS              __at(0x2CB8);	// @ (0x597 * 8 + 0)
#define                                 DACNSS_bit          _BIT_ACCESS(DAC3CON0,0)
// DAC1CON0<DACNSS0>
extern volatile __bit                   DACNSS0             __at(0x2C88);	// @ (0x591 * 8 + 0)
#define                                 DACNSS0_bit         _BIT_ACCESS(DAC1CON0,0)
// DAC1CON0<DACOE>
extern volatile __bit                   DACOE               __at(0x2C8D);	// @ (0x591 * 8 + 5)
#define                                 DACOE_bit           _BIT_ACCESS(DAC1CON0,5)
// DAC3REF<DACR0>
extern volatile __bit                   DACR0               __at(0x2CC0);	// @ (0x598 * 8 + 0)
#define                                 DACR0_bit           _BIT_ACCESS(DAC3REF,0)
// DAC3REF<DACR1>
extern volatile __bit                   DACR1               __at(0x2CC1);	// @ (0x598 * 8 + 1)
#define                                 DACR1_bit           _BIT_ACCESS(DAC3REF,1)
// DAC3REF<DACR2>
extern volatile __bit                   DACR2               __at(0x2CC2);	// @ (0x598 * 8 + 2)
#define                                 DACR2_bit           _BIT_ACCESS(DAC3REF,2)
// DAC3REF<DACR3>
extern volatile __bit                   DACR3               __at(0x2CC3);	// @ (0x598 * 8 + 3)
#define                                 DACR3_bit           _BIT_ACCESS(DAC3REF,3)
// DAC3REF<DACR4>
extern volatile __bit                   DACR4               __at(0x2CC4);	// @ (0x598 * 8 + 4)
#define                                 DACR4_bit           _BIT_ACCESS(DAC3REF,4)
// COG1DBF<DBF0>
extern volatile __bit                   DBF0                __at(0x3490);	// @ (0x692 * 8 + 0)
#define                                 DBF0_bit            _BIT_ACCESS(COG1DBF,0)
// COG1DBF<DBF1>
extern volatile __bit                   DBF1                __at(0x3491);	// @ (0x692 * 8 + 1)
#define                                 DBF1_bit            _BIT_ACCESS(COG1DBF,1)
// COG1DBF<DBF2>
extern volatile __bit                   DBF2                __at(0x3492);	// @ (0x692 * 8 + 2)
#define                                 DBF2_bit            _BIT_ACCESS(COG1DBF,2)
// COG1DBF<DBF3>
extern volatile __bit                   DBF3                __at(0x3493);	// @ (0x692 * 8 + 3)
#define                                 DBF3_bit            _BIT_ACCESS(COG1DBF,3)
// COG1DBF<DBF4>
extern volatile __bit                   DBF4                __at(0x3494);	// @ (0x692 * 8 + 4)
#define                                 DBF4_bit            _BIT_ACCESS(COG1DBF,4)
// COG1DBF<DBF5>
extern volatile __bit                   DBF5                __at(0x3495);	// @ (0x692 * 8 + 5)
#define                                 DBF5_bit            _BIT_ACCESS(COG1DBF,5)
// COG1DBR<DBR0>
extern volatile __bit                   DBR0                __at(0x3488);	// @ (0x691 * 8 + 0)
#define                                 DBR0_bit            _BIT_ACCESS(COG1DBR,0)
// COG1DBR<DBR1>
extern volatile __bit                   DBR1                __at(0x3489);	// @ (0x691 * 8 + 1)
#define                                 DBR1_bit            _BIT_ACCESS(COG1DBR,1)
// COG1DBR<DBR2>
extern volatile __bit                   DBR2                __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 DBR2_bit            _BIT_ACCESS(COG1DBR,2)
// COG1DBR<DBR3>
extern volatile __bit                   DBR3                __at(0x348B);	// @ (0x691 * 8 + 3)
#define                                 DBR3_bit            _BIT_ACCESS(COG1DBR,3)
// COG1DBR<DBR4>
extern volatile __bit                   DBR4                __at(0x348C);	// @ (0x691 * 8 + 4)
#define                                 DBR4_bit            _BIT_ACCESS(COG1DBR,4)
// COG1DBR<DBR5>
