MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1765/mcu.h
extern volatile __bit                   G1FSIM11            __at(0x34E3);	// @ (0x69C * 8 + 3)
#define                                 G1FSIM11_bit        _BIT_ACCESS(COG1FSIM1,3)
// COG1FSIM1<G1FSIM12>
extern volatile __bit                   G1FSIM12            __at(0x34E4);	// @ (0x69C * 8 + 4)
#define                                 G1FSIM12_bit        _BIT_ACCESS(COG1FSIM1,4)
// COG1FSIM1<G1FSIM13>
extern volatile __bit                   G1FSIM13            __at(0x34E5);	// @ (0x69C * 8 + 5)
#define                                 G1FSIM13_bit        _BIT_ACCESS(COG1FSIM1,5)
// COG1FSIM1<G1FSIM14>
extern volatile __bit                   G1FSIM14            __at(0x34E6);	// @ (0x69C * 8 + 6)
#define                                 G1FSIM14_bit        _BIT_ACCESS(COG1FSIM1,6)
// COG1FSIM0<G1FSIM2>
extern volatile __bit                   G1FSIM2             __at(0x34DA);	// @ (0x69B * 8 + 2)
#define                                 G1FSIM2_bit         _BIT_ACCESS(COG1FSIM0,2)
// COG1FSIM0<G1FSIM3>
extern volatile __bit                   G1FSIM3             __at(0x34DB);	// @ (0x69B * 8 + 3)
#define                                 G1FSIM3_bit         _BIT_ACCESS(COG1FSIM0,3)
// COG1FSIM0<G1FSIM4>
extern volatile __bit                   G1FSIM4             __at(0x34DC);	// @ (0x69B * 8 + 4)
#define                                 G1FSIM4_bit         _BIT_ACCESS(COG1FSIM0,4)
// COG1FSIM0<G1FSIM5>
extern volatile __bit                   G1FSIM5             __at(0x34DD);	// @ (0x69B * 8 + 5)
#define                                 G1FSIM5_bit         _BIT_ACCESS(COG1FSIM0,5)
// COG1FSIM0<G1FSIM6>
extern volatile __bit                   G1FSIM6             __at(0x34DE);	// @ (0x69B * 8 + 6)
#define                                 G1FSIM6_bit         _BIT_ACCESS(COG1FSIM0,6)
// COG1FSIM0<G1FSIM7>
extern volatile __bit                   G1FSIM7             __at(0x34DF);	// @ (0x69B * 8 + 7)
#define                                 G1FSIM7_bit         _BIT_ACCESS(COG1FSIM0,7)
// COG1FSIM1<G1FSIM8>
extern volatile __bit                   G1FSIM8             __at(0x34E0);	// @ (0x69C * 8 + 0)
#define                                 G1FSIM8_bit         _BIT_ACCESS(COG1FSIM1,0)
// COG1FSIM1<G1FSIM9>
extern volatile __bit                   G1FSIM9             __at(0x34E1);	// @ (0x69C * 8 + 1)
#define                                 G1FSIM9_bit         _BIT_ACCESS(COG1FSIM1,1)
// COG1CON0<G1LD>
extern volatile __bit                   G1LD                __at(0x349E);	// @ (0x693 * 8 + 6)
#define                                 G1LD_bit            _BIT_ACCESS(COG1CON0,6)
// COG1CON0<G1MD0>
extern volatile __bit                   G1MD0               __at(0x3498);	// @ (0x693 * 8 + 0)
#define                                 G1MD0_bit           _BIT_ACCESS(COG1CON0,0)
// COG1CON0<G1MD1>
extern volatile __bit                   G1MD1               __at(0x3499);	// @ (0x693 * 8 + 1)
#define                                 G1MD1_bit           _BIT_ACCESS(COG1CON0,1)
// COG1CON0<G1MD2>
extern volatile __bit                   G1MD2               __at(0x349A);	// @ (0x693 * 8 + 2)
#define                                 G1MD2_bit           _BIT_ACCESS(COG1CON0,2)
// COG1PHF<G1PHF0>
extern volatile __bit                   G1PHF0              __at(0x3470);	// @ (0x68E * 8 + 0)
#define                                 G1PHF0_bit          _BIT_ACCESS(COG1PHF,0)
// COG1PHF<G1PHF1>
extern volatile __bit                   G1PHF1              __at(0x3471);	// @ (0x68E * 8 + 1)
#define                                 G1PHF1_bit          _BIT_ACCESS(COG1PHF,1)
// COG1PHF<G1PHF2>
extern volatile __bit                   G1PHF2              __at(0x3472);	// @ (0x68E * 8 + 2)
#define                                 G1PHF2_bit          _BIT_ACCESS(COG1PHF,2)
// COG1PHF<G1PHF3>
extern volatile __bit                   G1PHF3              __at(0x3473);	// @ (0x68E * 8 + 3)
#define                                 G1PHF3_bit          _BIT_ACCESS(COG1PHF,3)
// COG1PHF<G1PHF4>
extern volatile __bit                   G1PHF4              __at(0x3474);	// @ (0x68E * 8 + 4)
#define                                 G1PHF4_bit          _BIT_ACCESS(COG1PHF,4)
// COG1PHF<G1PHF5>
extern volatile __bit                   G1PHF5              __at(0x3475);	// @ (0x68E * 8 + 5)
#define                                 G1PHF5_bit          _BIT_ACCESS(COG1PHF,5)
// COG1PHR<G1PHR0>
extern volatile __bit                   G1PHR0              __at(0x3468);	// @ (0x68D * 8 + 0)
#define                                 G1PHR0_bit          _BIT_ACCESS(COG1PHR,0)
// COG1PHR<G1PHR1>
extern volatile __bit                   G1PHR1              __at(0x3469);	// @ (0x68D * 8 + 1)
#define                                 G1PHR1_bit          _BIT_ACCESS(COG1PHR,1)
// COG1PHR<G1PHR2>
extern volatile __bit                   G1PHR2              __at(0x346A);	// @ (0x68D * 8 + 2)
#define                                 G1PHR2_bit          _BIT_ACCESS(COG1PHR,2)
// COG1PHR<G1PHR3>
extern volatile __bit                   G1PHR3              __at(0x346B);	// @ (0x68D * 8 + 3)
#define                                 G1PHR3_bit          _BIT_ACCESS(COG1PHR,3)
// COG1PHR<G1PHR4>
extern volatile __bit                   G1PHR4              __at(0x346C);	// @ (0x68D * 8 + 4)
#define                                 G1PHR4_bit          _BIT_ACCESS(COG1PHR,4)
// COG1PHR<G1PHR5>
extern volatile __bit                   G1PHR5              __at(0x346D);	// @ (0x68D * 8 + 5)
#define                                 G1PHR5_bit          _BIT_ACCESS(COG1PHR,5)
// COG1CON1<G1POLA>
extern volatile __bit                   G1POLA              __at(0x34A0);	// @ (0x694 * 8 + 0)
#define                                 G1POLA_bit          _BIT_ACCESS(COG1CON1,0)
// COG1CON1<G1POLB>
extern volatile __bit                   G1POLB              __at(0x34A1);	// @ (0x694 * 8 + 1)
#define                                 G1POLB_bit          _BIT_ACCESS(COG1CON1,1)
// COG1CON1<G1POLC>
extern volatile __bit                   G1POLC              __at(0x34A2);	// @ (0x694 * 8 + 2)
#define                                 G1POLC_bit          _BIT_ACCESS(COG1CON1,2)
// COG1CON1<G1POLD>
extern volatile __bit                   G1POLD              __at(0x34A3);	// @ (0x694 * 8 + 3)
#define                                 G1POLD_bit          _BIT_ACCESS(COG1CON1,3)
// COG1CON1<G1RDBS>
extern volatile __bit                   G1RDBS              __at(0x34A7);	// @ (0x694 * 8 + 7)
#define                                 G1RDBS_bit          _BIT_ACCESS(COG1CON1,7)
// COG1RIS0<G1RIS0>
extern volatile __bit                   G1RIS0              __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 G1RIS0_bit          _BIT_ACCESS(COG1RIS0,0)
// COG1RIS0<G1RIS1>
extern volatile __bit                   G1RIS1              __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 G1RIS1_bit          _BIT_ACCESS(COG1RIS0,1)
// COG1RIS1<G1RIS10>
extern volatile __bit                   G1RIS10             __at(0x34B2);	// @ (0x696 * 8 + 2)
#define                                 G1RIS10_bit         _BIT_ACCESS(COG1RIS1,2)
// COG1RIS1<G1RIS11>
extern volatile __bit                   G1RIS11             __at(0x34B3);	// @ (0x696 * 8 + 3)
#define                                 G1RIS11_bit         _BIT_ACCESS(COG1RIS1,3)
// COG1RIS1<G1RIS12>
extern volatile __bit                   G1RIS12             __at(0x34B4);	// @ (0x696 * 8 + 4)
#define                                 G1RIS12_bit         _BIT_ACCESS(COG1RIS1,4)
// COG1RIS1<G1RIS13>
extern volatile __bit                   G1RIS13             __at(0x34B5);	// @ (0x696 * 8 + 5)
#define                                 G1RIS13_bit         _BIT_ACCESS(COG1RIS1,5)
// COG1RIS1<G1RIS14>
extern volatile __bit                   G1RIS14             __at(0x34B6);	// @ (0x696 * 8 + 6)
#define                                 G1RIS14_bit         _BIT_ACCESS(COG1RIS1,6)
// COG1RIS0<G1RIS2>
extern volatile __bit                   G1RIS2              __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 G1RIS2_bit          _BIT_ACCESS(COG1RIS0,2)
// COG1RIS0<G1RIS3>
extern volatile __bit                   G1RIS3              __at(0x34AB);	// @ (0x695 * 8 + 3)
#define                                 G1RIS3_bit          _BIT_ACCESS(COG1RIS0,3)
// COG1RIS0<G1RIS4>
extern volatile __bit                   G1RIS4              __at(0x34AC);	// @ (0x695 * 8 + 4)
#define                                 G1RIS4_bit          _BIT_ACCESS(COG1RIS0,4)
// COG1RIS0<G1RIS5>
extern volatile __bit                   G1RIS5              __at(0x34AD);	// @ (0x695 * 8 + 5)
#define                                 G1RIS5_bit          _BIT_ACCESS(COG1RIS0,5)
// COG1RIS0<G1RIS6>
extern volatile __bit                   G1RIS6              __at(0x34AE);	// @ (0x695 * 8 + 6)
#define                                 G1RIS6_bit          _BIT_ACCESS(COG1RIS0,6)
// COG1RIS0<G1RIS7>
extern volatile __bit                   G1RIS7              __at(0x34AF);	// @ (0x695 * 8 + 7)
#define                                 G1RIS7_bit          _BIT_ACCESS(COG1RIS0,7)
// COG1RIS1<G1RIS8>
extern volatile __bit                   G1RIS8              __at(0x34B0);	// @ (0x696 * 8 + 0)
#define                                 G1RIS8_bit          _BIT_ACCESS(COG1RIS1,0)
// COG1RIS1<G1RIS9>
extern volatile __bit                   G1RIS9              __at(0x34B1);	// @ (0x696 * 8 + 1)
#define                                 G1RIS9_bit          _BIT_ACCESS(COG1RIS1,1)
// COG1RSIM0<G1RSIM0>
extern volatile __bit                   G1RSIM0             __at(0x34B8);	// @ (0x697 * 8 + 0)
#define                                 G1RSIM0_bit         _BIT_ACCESS(COG1RSIM0,0)
// COG1RSIM0<G1RSIM1>
extern volatile __bit                   G1RSIM1             __at(0x34B9);	// @ (0x697 * 8 + 1)
#define                                 G1RSIM1_bit         _BIT_ACCESS(COG1RSIM0,1)
// COG1RSIM1<G1RSIM10>
extern volatile __bit                   G1RSIM10            __at(0x34C2);	// @ (0x698 * 8 + 2)
#define                                 G1RSIM10_bit        _BIT_ACCESS(COG1RSIM1,2)
// COG1RSIM1<G1RSIM11>
extern volatile __bit                   G1RSIM11            __at(0x34C3);	// @ (0x698 * 8 + 3)
#define                                 G1RSIM11_bit        _BIT_ACCESS(COG1RSIM1,3)
// COG1RSIM1<G1RSIM12>
extern volatile __bit                   G1RSIM12            __at(0x34C4);	// @ (0x698 * 8 + 4)
#define                                 G1RSIM12_bit        _BIT_ACCESS(COG1RSIM1,4)
// COG1RSIM1<G1RSIM13>
extern volatile __bit                   G1RSIM13            __at(0x34C5);	// @ (0x698 * 8 + 5)
#define                                 G1RSIM13_bit        _BIT_ACCESS(COG1RSIM1,5)
// COG1RSIM1<G1RSIM14>
extern volatile __bit                   G1RSIM14            __at(0x34C6);	// @ (0x698 * 8 + 6)
#define                                 G1RSIM14_bit        _BIT_ACCESS(COG1RSIM1,6)
// COG1RSIM0<G1RSIM2>
extern volatile __bit                   G1RSIM2             __at(0x34BA);	// @ (0x697 * 8 + 2)
#define                                 G1RSIM2_bit         _BIT_ACCESS(COG1RSIM0,2)
// COG1RSIM0<G1RSIM3>
extern volatile __bit                   G1RSIM3             __at(0x34BB);	// @ (0x697 * 8 + 3)
#define                                 G1RSIM3_bit         _BIT_ACCESS(COG1RSIM0,3)
// COG1RSIM0<G1RSIM4>
extern volatile __bit                   G1RSIM4             __at(0x34BC);	// @ (0x697 * 8 + 4)
#define                                 G1RSIM4_bit         _BIT_ACCESS(COG1RSIM0,4)
// COG1RSIM0<G1RSIM5>
extern volatile __bit                   G1RSIM5             __at(0x34BD);	// @ (0x697 * 8 + 5)
#define                                 G1RSIM5_bit         _BIT_ACCESS(COG1RSIM0,5)
// COG1RSIM0<G1RSIM6>
extern volatile __bit                   G1RSIM6             __at(0x34BE);	// @ (0x697 * 8 + 6)
#define                                 G1RSIM6_bit         _BIT_ACCESS(COG1RSIM0,6)
// COG1RSIM0<G1RSIM7>
extern volatile __bit                   G1RSIM7             __at(0x34BF);	// @ (0x697 * 8 + 7)
#define                                 G1RSIM7_bit         _BIT_ACCESS(COG1RSIM0,7)
// COG1RSIM1<G1RSIM8>
extern volatile __bit                   G1RSIM8             __at(0x34C0);	// @ (0x698 * 8 + 0)
#define                                 G1RSIM8_bit         _BIT_ACCESS(COG1RSIM1,0)
// COG1RSIM1<G1RSIM9>
extern volatile __bit                   G1RSIM9             __at(0x34C1);	// @ (0x698 * 8 + 1)
#define                                 G1RSIM9_bit         _BIT_ACCESS(COG1RSIM1,1)
// COG1STR<G1SDATA>
extern volatile __bit                   G1SDATA             __at(0x34FC);	// @ (0x69F * 8 + 4)
#define                                 G1SDATA_bit         _BIT_ACCESS(COG1STR,4)
// COG1STR<G1SDATB>
extern volatile __bit                   G1SDATB             __at(0x34FD);	// @ (0x69F * 8 + 5)
#define                                 G1SDATB_bit         _BIT_ACCESS(COG1STR,5)
// COG1STR<G1SDATC>
extern volatile __bit                   G1SDATC             __at(0x34FE);	// @ (0x69F * 8 + 6)
#define                                 G1SDATC_bit         _BIT_ACCESS(COG1STR,6)
// COG1STR<G1SDATD>
extern volatile __bit                   G1SDATD             __at(0x34FF);	// @ (0x69F * 8 + 7)
#define                                 G1SDATD_bit         _BIT_ACCESS(COG1STR,7)
// COG1STR<G1STRA>
extern volatile __bit                   G1STRA              __at(0x34F8);	// @ (0x69F * 8 + 0)
#define                                 G1STRA_bit          _BIT_ACCESS(COG1STR,0)
// COG1STR<G1STRB>
extern volatile __bit                   G1STRB              __at(0x34F9);	// @ (0x69F * 8 + 1)
#define                                 G1STRB_bit          _BIT_ACCESS(COG1STR,1)
// COG1STR<G1STRC>
extern volatile __bit                   G1STRC              __at(0x34FA);	// @ (0x69F * 8 + 2)
#define                                 G1STRC_bit          _BIT_ACCESS(COG1STR,2)
// COG1STR<G1STRD>
extern volatile __bit                   G1STRD              __at(0x34FB);	// @ (0x69F * 8 + 3)
#define                                 G1STRD_bit          _BIT_ACCESS(COG1STR,3)
// SSP1CON2<GCEN>
extern volatile __bit                   GCEN                __at(0x10B7);	// @ (0x216 * 8 + 7)
#define                                 GCEN_bit            _BIT_ACCESS(SSP1CON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// OSCSTAT<HFIOFL>
extern volatile __bit                   HFIOFL              __at(0x4D3);	// @ (0x9A * 8 + 3)
#define                                 HFIOFL_bit          _BIT_ACCESS(OSCSTAT,3)
// OSCSTAT<HFIOFR>
extern volatile __bit                   HFIOFR              __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 HFIOFR_bit          _BIT_ACCESS(OSCSTAT,4)
// OSCSTAT<HFIOFS>
extern volatile __bit                   HFIOFS              __at(0x4D0);	// @ (0x9A * 8 + 0)
#define                                 HFIOFS_bit          _BIT_ACCESS(OSCSTAT,0)
// HIDRVC<HIDC4>
extern volatile __bit                   HIDC4               __at(0x2074);	// @ (0x40E * 8 + 4)
#define                                 HIDC4_bit           _BIT_ACCESS(HIDRVC,4)
// HIDRVC<HIDC5>
extern volatile __bit                   HIDC5               __at(0x2075);	// @ (0x40E * 8 + 5)
#define                                 HIDC5_bit           _BIT_ACCESS(HIDRVC,5)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x1C60);	// @ (0x38C * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x1C61);	// @ (0x38C * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x1C62);	// @ (0x38C * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x1C63);	// @ (0x38C * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x1C64);	// @ (0x38C * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x1C65);	// @ (0x38C * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0x1C70);	// @ (0x38E * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0x1C71);	// @ (0x38E * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC2>
extern volatile __bit                   INLVLC2             __at(0x1C72);	// @ (0x38E * 8 + 2)
#define                                 INLVLC2_bit         _BIT_ACCESS(INLVLC,2)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0x1C73);	// @ (0x38E * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0x1C74);	// @ (0x38E * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0x1C75);	// @ (0x38E * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// PRG1INS<INS0>
extern volatile __bit                   INS0                __at(0x3CB0);	// @ (0x796 * 8 + 0)
#define                                 INS0_bit            _BIT_ACCESS(PRG1INS,0)
// PRG1INS<INS1>
extern volatile __bit                   INS1                __at(0x3CB1);	// @ (0x796 * 8 + 1)
#define                                 INS1_bit            _BIT_ACCESS(PRG1INS,1)
// PRG1INS<INS2>
extern volatile __bit                   INS2                __at(0x3CB2);	// @ (0x796 * 8 + 2)
#define                                 INS2_bit            _BIT_ACCESS(PRG1INS,2)
// PRG1INS<INS3>
extern volatile __bit                   INS3                __at(0x3CB3);	// @ (0x796 * 8 + 3)
#define                                 INS3_bit            _BIT_ACCESS(PRG1INS,3)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x4AE);	// @ (0x95 * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x1C98);	// @ (0x393 * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x1C99);	// @ (0x393 * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x1C9A);	// @ (0x393 * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x1C9B);	// @ (0x393 * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x1C9C);	// @ (0x393 * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x1C9D);	// @ (0x393 * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x1C90);	// @ (0x392 * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x1C91);	// @ (0x392 * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0x1C92);	// @ (0x392 * 8 + 2)
#define                                 IOCAN2_bit          _BIT_ACCESS(IOCAN,2)
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0x1C93);	// @ (0x392 * 8 + 3)
#define                                 IOCAN3_bit          _BIT_ACCESS(IOCAN,3)
// IOCAN<IOCAN4>
extern volatile __bit                   IOCAN4              __at(0x1C94);	// @ (0x392 * 8 + 4)
#define                                 IOCAN4_bit          _BIT_ACCESS(IOCAN,4)
// IOCAN<IOCAN5>
extern volatile __bit                   IOCAN5              __at(0x1C95);	// @ (0x392 * 8 + 5)
#define                                 IOCAN5_bit          _BIT_ACCESS(IOCAN,5)
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0x1C88);	// @ (0x391 * 8 + 0)
#define                                 IOCAP0_bit          _BIT_ACCESS(IOCAP,0)
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0x1C89);	// @ (0x391 * 8 + 1)
#define                                 IOCAP1_bit          _BIT_ACCESS(IOCAP,1)
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0x1C8A);	// @ (0x391 * 8 + 2)
#define                                 IOCAP2_bit          _BIT_ACCESS(IOCAP,2)
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0x1C8B);	// @ (0x391 * 8 + 3)
#define                                 IOCAP3_bit          _BIT_ACCESS(IOCAP,3)
// IOCAP<IOCAP4>
extern volatile __bit                   IOCAP4              __at(0x1C8C);	// @ (0x391 * 8 + 4)
#define                                 IOCAP4_bit          _BIT_ACCESS(IOCAP,4)
// IOCAP<IOCAP5>
extern volatile __bit                   IOCAP5              __at(0x1C8D);	// @ (0x391 * 8 + 5)
#define                                 IOCAP5_bit          _BIT_ACCESS(IOCAP,5)
// IOCCF<IOCCF0>
extern volatile __bit                   IOCCF0              __at(0x1CC8);	// @ (0x399 * 8 + 0)
#define                                 IOCCF0_bit          _BIT_ACCESS(IOCCF,0)
// IOCCF<IOCCF1>
extern volatile __bit                   IOCCF1              __at(0x1CC9);	// @ (0x399 * 8 + 1)
#define                                 IOCCF1_bit          _BIT_ACCESS(IOCCF,1)
// IOCCF<IOCCF2>
extern volatile __bit                   IOCCF2              __at(0x1CCA);	// @ (0x399 * 8 + 2)
#define                                 IOCCF2_bit          _BIT_ACCESS(IOCCF,2)
// IOCCF<IOCCF3>
extern volatile __bit                   IOCCF3              __at(0x1CCB);	// @ (0x399 * 8 + 3)
#define                                 IOCCF3_bit          _BIT_ACCESS(IOCCF,3)
// IOCCF<IOCCF4>
extern volatile __bit                   IOCCF4              __at(0x1CCC);	// @ (0x399 * 8 + 4)
#define                                 IOCCF4_bit          _BIT_ACCESS(IOCCF,4)
// IOCCF<IOCCF5>
extern volatile __bit                   IOCCF5              __at(0x1CCD);	// @ (0x399 * 8 + 5)
