MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1765/mcu.h
extern volatile __bit                   LFIOFR              __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 LFIOFR_bit          _BIT_ACCESS(OSCSTAT,1)
// PMCON1<LWLO>
extern volatile __bit                   LWLO                __at(0xCAD);	// @ (0x195 * 8 + 5)
#define                                 LWLO_bit            _BIT_ACCESS(PMCON1,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x878);	// @ (0x10F * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x879);	// @ (0x10F * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// CLCDATA<MCLC1OUT>
extern volatile __bit                   MCLC1OUT            __at(0x7878);	// @ (0xF0F * 8 + 0)
#define                                 MCLC1OUT_bit        _BIT_ACCESS(CLCDATA,0)
// CLCDATA<MCLC2OUT>
extern volatile __bit                   MCLC2OUT            __at(0x7879);	// @ (0xF0F * 8 + 1)
#define                                 MCLC2OUT_bit        _BIT_ACCESS(CLCDATA,1)
// CLCDATA<MCLC3OUT>
extern volatile __bit                   MCLC3OUT            __at(0x787A);	// @ (0xF0F * 8 + 2)
#define                                 MCLC3OUT_bit        _BIT_ACCESS(CLCDATA,2)
// COG1CON0<MD0>
extern volatile __bit                   MD0                 __at(0x3498);	// @ (0x693 * 8 + 0)
#define                                 MD0_bit             _BIT_ACCESS(COG1CON0,0)
// COG1CON0<MD1>
extern volatile __bit                   MD1                 __at(0x3499);	// @ (0x693 * 8 + 1)
#define                                 MD1_bit             _BIT_ACCESS(COG1CON0,1)
// MD1CON0<MD1BIT>
extern volatile __bit                   MD1BIT              __at(0x1CD8);	// @ (0x39B * 8 + 0)
#define                                 MD1BIT_bit          _BIT_ACCESS(MD1CON0,0)
// MD1CARH<MD1CH0>
extern volatile __bit                   MD1CH0              __at(0x1CF8);	// @ (0x39F * 8 + 0)
#define                                 MD1CH0_bit          _BIT_ACCESS(MD1CARH,0)
// MD1CARH<MD1CH1>
extern volatile __bit                   MD1CH1              __at(0x1CF9);	// @ (0x39F * 8 + 1)
#define                                 MD1CH1_bit          _BIT_ACCESS(MD1CARH,1)
// MD1CARH<MD1CH2>
extern volatile __bit                   MD1CH2              __at(0x1CFA);	// @ (0x39F * 8 + 2)
#define                                 MD1CH2_bit          _BIT_ACCESS(MD1CARH,2)
// MD1CARH<MD1CH3>
extern volatile __bit                   MD1CH3              __at(0x1CFB);	// @ (0x39F * 8 + 3)
#define                                 MD1CH3_bit          _BIT_ACCESS(MD1CARH,3)
// MD1CON1<MD1CHPOL>
extern volatile __bit                   MD1CHPOL            __at(0x1CE5);	// @ (0x39C * 8 + 5)
#define                                 MD1CHPOL_bit        _BIT_ACCESS(MD1CON1,5)
// MD1CON1<MD1CHSYNC>
extern volatile __bit                   MD1CHSYNC           __at(0x1CE4);	// @ (0x39C * 8 + 4)
#define                                 MD1CHSYNC_bit       _BIT_ACCESS(MD1CON1,4)
// MD1CARL<MD1CL0>
extern volatile __bit                   MD1CL0              __at(0x1CF0);	// @ (0x39E * 8 + 0)
#define                                 MD1CL0_bit          _BIT_ACCESS(MD1CARL,0)
// MD1CARL<MD1CL1>
extern volatile __bit                   MD1CL1              __at(0x1CF1);	// @ (0x39E * 8 + 1)
#define                                 MD1CL1_bit          _BIT_ACCESS(MD1CARL,1)
// MD1CARL<MD1CL2>
extern volatile __bit                   MD1CL2              __at(0x1CF2);	// @ (0x39E * 8 + 2)
#define                                 MD1CL2_bit          _BIT_ACCESS(MD1CARL,2)
// MD1CARL<MD1CL3>
extern volatile __bit                   MD1CL3              __at(0x1CF3);	// @ (0x39E * 8 + 3)
#define                                 MD1CL3_bit          _BIT_ACCESS(MD1CARL,3)
// MD1CON1<MD1CLPOL>
extern volatile __bit                   MD1CLPOL            __at(0x1CE1);	// @ (0x39C * 8 + 1)
#define                                 MD1CLPOL_bit        _BIT_ACCESS(MD1CON1,1)
// MD1CON1<MD1CLSYNC>
extern volatile __bit                   MD1CLSYNC           __at(0x1CE0);	// @ (0x39C * 8 + 0)
#define                                 MD1CLSYNC_bit       _BIT_ACCESS(MD1CON1,0)
// MD1CON0<MD1EN>
extern volatile __bit                   MD1EN               __at(0x1CDF);	// @ (0x39B * 8 + 7)
#define                                 MD1EN_bit           _BIT_ACCESS(MD1CON0,7)
// MD1SRC<MD1MS0>
extern volatile __bit                   MD1MS0              __at(0x1CE8);	// @ (0x39D * 8 + 0)
#define                                 MD1MS0_bit          _BIT_ACCESS(MD1SRC,0)
// MD1SRC<MD1MS1>
extern volatile __bit                   MD1MS1              __at(0x1CE9);	// @ (0x39D * 8 + 1)
#define                                 MD1MS1_bit          _BIT_ACCESS(MD1SRC,1)
// MD1SRC<MD1MS2>
extern volatile __bit                   MD1MS2              __at(0x1CEA);	// @ (0x39D * 8 + 2)
#define                                 MD1MS2_bit          _BIT_ACCESS(MD1SRC,2)
// MD1SRC<MD1MS3>
extern volatile __bit                   MD1MS3              __at(0x1CEB);	// @ (0x39D * 8 + 3)
#define                                 MD1MS3_bit          _BIT_ACCESS(MD1SRC,3)
// MD1SRC<MD1MS4>
extern volatile __bit                   MD1MS4              __at(0x1CEC);	// @ (0x39D * 8 + 4)
#define                                 MD1MS4_bit          _BIT_ACCESS(MD1SRC,4)
// MD1CON0<MD1OPOL>
extern volatile __bit                   MD1OPOL             __at(0x1CDC);	// @ (0x39B * 8 + 4)
#define                                 MD1OPOL_bit         _BIT_ACCESS(MD1CON0,4)
// MD1CON0<MD1OUT>
extern volatile __bit                   MD1OUT              __at(0x1CDD);	// @ (0x39B * 8 + 5)
#define                                 MD1OUT_bit          _BIT_ACCESS(MD1CON0,5)
// COG1CON0<MD2>
extern volatile __bit                   MD2                 __at(0x349A);	// @ (0x693 * 8 + 2)
#define                                 MD2_bit             _BIT_ACCESS(COG1CON0,2)
// OSCSTAT<MFIOFR>
extern volatile __bit                   MFIOFR              __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 MFIOFR_bit          _BIT_ACCESS(OSCSTAT,2)
// PWMEN<MPWM5EN>
extern volatile __bit                   MPWM5EN             __at(0x6C74);	// @ (0xD8E * 8 + 4)
#define                                 MPWM5EN_bit         _BIT_ACCESS(PWMEN,4)
// PWMLD<MPWM5LD>
extern volatile __bit                   MPWM5LD             __at(0x6C7C);	// @ (0xD8F * 8 + 4)
#define                                 MPWM5LD_bit         _BIT_ACCESS(PWMLD,4)
// PWMOUT<MPWM5OUT>
extern volatile __bit                   MPWM5OUT            __at(0x6C84);	// @ (0xD90 * 8 + 4)
#define                                 MPWM5OUT_bit        _BIT_ACCESS(PWMOUT,4)
// MD1SRC<MS0>
extern volatile __bit                   MS0                 __at(0x1CE8);	// @ (0x39D * 8 + 0)
#define                                 MS0_bit             _BIT_ACCESS(MD1SRC,0)
// MD1SRC<MS1>
extern volatile __bit                   MS1                 __at(0x1CE9);	// @ (0x39D * 8 + 1)
#define                                 MS1_bit             _BIT_ACCESS(MD1SRC,1)
// MD1SRC<MS2>
extern volatile __bit                   MS2                 __at(0x1CEA);	// @ (0x39D * 8 + 2)
#define                                 MS2_bit             _BIT_ACCESS(MD1SRC,2)
// MD1SRC<MS3>
extern volatile __bit                   MS3                 __at(0x1CEB);	// @ (0x39D * 8 + 3)
#define                                 MS3_bit             _BIT_ACCESS(MD1SRC,3)
// MD1SRC<MS4>
extern volatile __bit                   MS4                 __at(0x1CEC);	// @ (0x39D * 8 + 4)
#define                                 MS4_bit             _BIT_ACCESS(MD1SRC,4)
// SSP1MSK<MSK0>
extern volatile __bit                   MSK0                __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 MSK0_bit            _BIT_ACCESS(SSP1MSK,0)
// SSP1MSK<MSK1>
extern volatile __bit                   MSK1                __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 MSK1_bit            _BIT_ACCESS(SSP1MSK,1)
// SSP1MSK<MSK2>
extern volatile __bit                   MSK2                __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 MSK2_bit            _BIT_ACCESS(SSP1MSK,2)
// SSP1MSK<MSK3>
extern volatile __bit                   MSK3                __at(0x109B);	// @ (0x213 * 8 + 3)
#define                                 MSK3_bit            _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<MSK4>
extern volatile __bit                   MSK4                __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 MSK4_bit            _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<MSK5>
extern volatile __bit                   MSK5                __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 MSK5_bit            _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<MSK6>
extern volatile __bit                   MSK6                __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 MSK6_bit            _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<MSK7>
extern volatile __bit                   MSK7                __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 MSK7_bit            _BIT_ACCESS(SSP1MSK,7)
// DAC3CON0<NSS>
extern volatile __bit                   NSS                 __at(0x2CB8);	// @ (0x597 * 8 + 0)
#define                                 NSS_bit             _BIT_ACCESS(DAC3CON0,0)
// DAC1CON0<NSS0>
extern volatile __bit                   NSS0                __at(0x2C88);	// @ (0x591 * 8 + 0)
#define                                 NSS0_bit            _BIT_ACCESS(DAC1CON0,0)
// ODCONA<ODA0>
extern volatile __bit                   ODA0                __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 ODA0_bit            _BIT_ACCESS(ODCONA,0)
// ODCONA<ODA1>
extern volatile __bit                   ODA1                __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 ODA1_bit            _BIT_ACCESS(ODCONA,1)
// ODCONA<ODA2>
extern volatile __bit                   ODA2                __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 ODA2_bit            _BIT_ACCESS(ODCONA,2)
// ODCONA<ODA4>
extern volatile __bit                   ODA4                __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 ODA4_bit            _BIT_ACCESS(ODCONA,4)
// ODCONA<ODA5>
extern volatile __bit                   ODA5                __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 ODA5_bit            _BIT_ACCESS(ODCONA,5)
// ODCONC<ODC0>
extern volatile __bit                   ODC0                __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 ODC0_bit            _BIT_ACCESS(ODCONC,0)
// ODCONC<ODC1>
extern volatile __bit                   ODC1                __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 ODC1_bit            _BIT_ACCESS(ODCONC,1)
// ODCONC<ODC2>
extern volatile __bit                   ODC2                __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 ODC2_bit            _BIT_ACCESS(ODCONC,2)
// ODCONC<ODC3>
extern volatile __bit                   ODC3                __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 ODC3_bit            _BIT_ACCESS(ODCONC,3)
// ODCONC<ODC4>
extern volatile __bit                   ODC4                __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 ODC4_bit            _BIT_ACCESS(ODCONC,4)
// ODCONC<ODC5>
extern volatile __bit                   ODC5                __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 ODC5_bit            _BIT_ACCESS(ODCONC,5)
// DAC1CON0<OE>
extern volatile __bit                   OE                  __at(0x2C8D);	// @ (0x591 * 8 + 5)
#define                                 OE_bit              _BIT_ACCESS(DAC1CON0,5)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// PWM5INTE<OFIE>
extern volatile __bit                   OFIE                __at(0x6CE3);	// @ (0xD9C * 8 + 3)
#define                                 OFIE_bit            _BIT_ACCESS(PWM5INTE,3)
// PWM5INTF<OFIF>
extern volatile __bit                   OFIF                __at(0x6CEB);	// @ (0xD9D * 8 + 3)
#define                                 OFIF_bit            _BIT_ACCESS(PWM5INTF,3)
// PWM5OFCON<OFO>
extern volatile __bit                   OFO                 __at(0x6D04);	// @ (0xDA0 * 8 + 4)
#define                                 OFO_bit             _BIT_ACCESS(PWM5OFCON,4)
// OPA1CON<OPA1EN>
extern volatile __bit                   OPA1EN              __at(0x288F);	// @ (0x511 * 8 + 7)
#define                                 OPA1EN_bit          _BIT_ACCESS(OPA1CON,7)
// OPA1CON<OPA1ORM0>
extern volatile __bit                   OPA1ORM0            __at(0x2888);	// @ (0x511 * 8 + 0)
#define                                 OPA1ORM0_bit        _BIT_ACCESS(OPA1CON,0)
// OPA1CON<OPA1ORM1>
extern volatile __bit                   OPA1ORM1            __at(0x2889);	// @ (0x511 * 8 + 1)
#define                                 OPA1ORM1_bit        _BIT_ACCESS(OPA1CON,1)
// OPA1CON<OPA1ORPOL>
extern volatile __bit                   OPA1ORPOL           __at(0x288A);	// @ (0x511 * 8 + 2)
#define                                 OPA1ORPOL_bit       _BIT_ACCESS(OPA1CON,2)
// OPA1CON<OPA1UG>
extern volatile __bit                   OPA1UG              __at(0x288C);	// @ (0x511 * 8 + 4)
#define                                 OPA1UG_bit          _BIT_ACCESS(OPA1CON,4)
// MD1CON0<OPOL>
extern volatile __bit                   OPOL                __at(0x1CDC);	// @ (0x39B * 8 + 4)
#define                                 OPOL_bit            _BIT_ACCESS(MD1CON0,4)
// OPA1CON<ORM0>
extern volatile __bit                   ORM0                __at(0x2888);	// @ (0x511 * 8 + 0)
#define                                 ORM0_bit            _BIT_ACCESS(OPA1CON,0)
// OPA1CON<ORM1>
extern volatile __bit                   ORM1                __at(0x2889);	// @ (0x511 * 8 + 1)
#define                                 ORM1_bit            _BIT_ACCESS(OPA1CON,1)
// OPA1CON<ORPOL>
extern volatile __bit                   ORPOL               __at(0x288A);	// @ (0x511 * 8 + 2)
#define                                 ORPOL_bit           _BIT_ACCESS(OPA1CON,2)
// PRG1CON0<OS>
extern volatile __bit                   OS                  __at(0x3CB9);	// @ (0x797 * 8 + 1)
#define                                 OS_bit              _BIT_ACCESS(PRG1CON0,1)
// T1CON<OSCEN>
extern volatile __bit                   OSCEN               __at(0xC3);	// @ (0x18 * 8 + 3)
#define                                 OSCEN_bit           _BIT_ACCESS(T1CON,3)
// PIE2<OSFIE>
extern volatile __bit                   OSFIE               __at(0x497);	// @ (0x92 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE2,7)
// PIR2<OSFIF>
extern volatile __bit                   OSFIF               __at(0x97);	// @ (0x12 * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR2,7)
// OSCSTAT<OSTS>
extern volatile __bit                   OSTS                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 OSTS_bit            _BIT_ACCESS(OSCSTAT,5)
// CCPTMRS<P3TSEL0>
extern volatile __bit                   P3TSEL0             __at(0x14F4);	// @ (0x29E * 8 + 4)
#define                                 P3TSEL0_bit         _BIT_ACCESS(CCPTMRS,4)
// CCPTMRS<P3TSEL1>
extern volatile __bit                   P3TSEL1             __at(0x14F5);	// @ (0x29E * 8 + 5)
#define                                 P3TSEL1_bit         _BIT_ACCESS(CCPTMRS,5)
// SSP1CON3<PCIE>
extern volatile __bit                   PCIE                __at(0x10BE);	// @ (0x217 * 8 + 6)
#define                                 PCIE_bit            _BIT_ACCESS(SSP1CON3,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN>
extern volatile __bit                   PEN                 __at(0x10B2);	// @ (0x216 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSP1CON2,2)
// COG1PHF<PHF0>
extern volatile __bit                   PHF0                __at(0x3470);	// @ (0x68E * 8 + 0)
#define                                 PHF0_bit            _BIT_ACCESS(COG1PHF,0)
// COG1PHF<PHF1>
extern volatile __bit                   PHF1                __at(0x3471);	// @ (0x68E * 8 + 1)
#define                                 PHF1_bit            _BIT_ACCESS(COG1PHF,1)
// COG1PHF<PHF2>
extern volatile __bit                   PHF2                __at(0x3472);	// @ (0x68E * 8 + 2)
#define                                 PHF2_bit            _BIT_ACCESS(COG1PHF,2)
// COG1PHF<PHF3>
extern volatile __bit                   PHF3                __at(0x3473);	// @ (0x68E * 8 + 3)
#define                                 PHF3_bit            _BIT_ACCESS(COG1PHF,3)
// COG1PHF<PHF4>
extern volatile __bit                   PHF4                __at(0x3474);	// @ (0x68E * 8 + 4)
#define                                 PHF4_bit            _BIT_ACCESS(COG1PHF,4)
// COG1PHF<PHF5>
extern volatile __bit                   PHF5                __at(0x3475);	// @ (0x68E * 8 + 5)
#define                                 PHF5_bit            _BIT_ACCESS(COG1PHF,5)
// PWM5INTE<PHIE>
extern volatile __bit                   PHIE                __at(0x6CE2);	// @ (0xD9C * 8 + 2)
#define                                 PHIE_bit            _BIT_ACCESS(PWM5INTE,2)
// PWM5INTF<PHIF>
extern volatile __bit                   PHIF                __at(0x6CEA);	// @ (0xD9D * 8 + 2)
#define                                 PHIF_bit            _BIT_ACCESS(PWM5INTF,2)
// COG1PHR<PHR0>
extern volatile __bit                   PHR0                __at(0x3468);	// @ (0x68D * 8 + 0)
#define                                 PHR0_bit            _BIT_ACCESS(COG1PHR,0)
// COG1PHR<PHR1>
extern volatile __bit                   PHR1                __at(0x3469);	// @ (0x68D * 8 + 1)
#define                                 PHR1_bit            _BIT_ACCESS(COG1PHR,1)
// COG1PHR<PHR2>
extern volatile __bit                   PHR2                __at(0x346A);	// @ (0x68D * 8 + 2)
#define                                 PHR2_bit            _BIT_ACCESS(COG1PHR,2)
// COG1PHR<PHR3>
extern volatile __bit                   PHR3                __at(0x346B);	// @ (0x68D * 8 + 3)
#define                                 PHR3_bit            _BIT_ACCESS(COG1PHR,3)
// COG1PHR<PHR4>
extern volatile __bit                   PHR4                __at(0x346C);	// @ (0x68D * 8 + 4)
#define                                 PHR4_bit            _BIT_ACCESS(COG1PHR,4)
// COG1PHR<PHR5>
extern volatile __bit                   PHR5                __at(0x346D);	// @ (0x68D * 8 + 5)
#define                                 PHR5_bit            _BIT_ACCESS(COG1PHR,5)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x4D6);	// @ (0x9A * 8 + 6)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,6)
// COG1CON1<POLA>
extern volatile __bit                   POLA                __at(0x34A0);	// @ (0x694 * 8 + 0)
#define                                 POLA_bit            _BIT_ACCESS(COG1CON1,0)
// COG1CON1<POLB>
extern volatile __bit                   POLB                __at(0x34A1);	// @ (0x694 * 8 + 1)
#define                                 POLB_bit            _BIT_ACCESS(COG1CON1,1)
// COG1CON1<POLC>
extern volatile __bit                   POLC                __at(0x34A2);	// @ (0x694 * 8 + 2)
#define                                 POLC_bit            _BIT_ACCESS(COG1CON1,2)
// COG1CON1<POLD>
extern volatile __bit                   POLD                __at(0x34A3);	// @ (0x694 * 8 + 3)
#define                                 POLD_bit            _BIT_ACCESS(COG1CON1,3)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x7078);	// @ (0xE0F * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// PWM5INTE<PRIE>
extern volatile __bit                   PRIE                __at(0x6CE0);	// @ (0xD9C * 8 + 0)
#define                                 PRIE_bit            _BIT_ACCESS(PWM5INTE,0)
// PWM5INTF<PRIF>
extern volatile __bit                   PRIF                __at(0x6CE8);	// @ (0xD9D * 8 + 0)
#define                                 PRIF_bit            _BIT_ACCESS(PWM5INTF,0)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x4AB);	// @ (0x95 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PWM3DCL<PWM3DC0>
extern volatile __bit                   PWM3DC0             __at(0x30BE);	// @ (0x617 * 8 + 6)
#define                                 PWM3DC0_bit         _BIT_ACCESS(PWM3DCL,6)
// PWM3DCL<PWM3DC1>
extern volatile __bit                   PWM3DC1             __at(0x30BF);	// @ (0x617 * 8 + 7)
#define                                 PWM3DC1_bit         _BIT_ACCESS(PWM3DCL,7)
// PWM3DCH<PWM3DC2>
extern volatile __bit                   PWM3DC2             __at(0x30C0);	// @ (0x618 * 8 + 0)
#define                                 PWM3DC2_bit         _BIT_ACCESS(PWM3DCH,0)
// PWM3DCH<PWM3DC3>
extern volatile __bit                   PWM3DC3             __at(0x30C1);	// @ (0x618 * 8 + 1)
#define                                 PWM3DC3_bit         _BIT_ACCESS(PWM3DCH,1)
// PWM3DCH<PWM3DC4>
extern volatile __bit                   PWM3DC4             __at(0x30C2);	// @ (0x618 * 8 + 2)
#define                                 PWM3DC4_bit         _BIT_ACCESS(PWM3DCH,2)
// PWM3DCH<PWM3DC5>
extern volatile __bit                   PWM3DC5             __at(0x30C3);	// @ (0x618 * 8 + 3)
#define                                 PWM3DC5_bit         _BIT_ACCESS(PWM3DCH,3)
// PWM3DCH<PWM3DC6>
extern volatile __bit                   PWM3DC6             __at(0x30C4);	// @ (0x618 * 8 + 4)
#define                                 PWM3DC6_bit         _BIT_ACCESS(PWM3DCH,4)
// PWM3DCH<PWM3DC7>
extern volatile __bit                   PWM3DC7             __at(0x30C5);	// @ (0x618 * 8 + 5)
#define                                 PWM3DC7_bit         _BIT_ACCESS(PWM3DCH,5)
// PWM3DCH<PWM3DC8>
extern volatile __bit                   PWM3DC8             __at(0x30C6);	// @ (0x618 * 8 + 6)
#define                                 PWM3DC8_bit         _BIT_ACCESS(PWM3DCH,6)
// PWM3DCH<PWM3DC9>
extern volatile __bit                   PWM3DC9             __at(0x30C7);	// @ (0x618 * 8 + 7)
#define                                 PWM3DC9_bit         _BIT_ACCESS(PWM3DCH,7)
// PWM3CON<PWM3EN>
extern volatile __bit                   PWM3EN              __at(0x30CF);	// @ (0x619 * 8 + 7)
#define                                 PWM3EN_bit          _BIT_ACCESS(PWM3CON,7)
// PWM3CON<PWM3OUT>
extern volatile __bit                   PWM3OUT             __at(0x30CD);	// @ (0x619 * 8 + 5)
#define                                 PWM3OUT_bit         _BIT_ACCESS(PWM3CON,5)
// PWM3CON<PWM3POL>
extern volatile __bit                   PWM3POL             __at(0x30CC);	// @ (0x619 * 8 + 4)
#define                                 PWM3POL_bit         _BIT_ACCESS(PWM3CON,4)
// PWM5CLKCON<PWM5CS0>
extern volatile __bit                   PWM5CS0             __at(0x6CF0);	// @ (0xD9E * 8 + 0)
#define                                 PWM5CS0_bit         _BIT_ACCESS(PWM5CLKCON,0)
// PWM5CLKCON<PWM5CS1>
extern volatile __bit                   PWM5CS1             __at(0x6CF1);	// @ (0xD9E * 8 + 1)
